{"_id":{"$oid":"5ceb91b3564b462b14dc2fe2"},"id":{"$numberInt":"0"},"dp_name":"資訊工程系","dp_abb":"CS","dp_img_file":"img/cs.gif","dp_intro":"Computer science is the study of processes that interact with data and that can be represented as data in the form of programs.","sb_name":["線性代數","微積分","演算法","作業系統","電腦網路","離散數學"],"sb_img_file":["img/la.jpg","img/cal.jpg","img/alg.jpg","img/os.jpg","img/cn.jpg","img/dm.jpg"],"sb_intro":["Linear algebra is central to almost all areas of mathematics. For instance, linear algebra is fundamental in modern presentations of geometry, including for defining basic objects such as lines, planes and rotations. ","Calculus is the mathematical study of continuous change, in the same way that geometry is the study of shape and algebra is the study of generalizations of arithmetic operations.","In mathematics and computer science, an algorithm  is an unambiguous specification of how to solve a class of problems.","An operating system (OS) is system software that manages computer hardware and software resources and provides common services for computer programs.","A computer network is a digital telecommunications network which allows nodes to share resources. In computer networks, computing devices exchange data with each other using connections (data links) between nodes.","Discrete mathematics is the study of mathematical structures that are fundamentally discrete rather than continuous. In contrast to real numbers that have the property of varying \"smoothly\", the objects studied in discrete mathematics"]}
{"_id":{"$oid":"5cf4c3d1c487b94af4379e78"},"id":"1","dp_name":"電機系","dp_abb":"EE","dp_img_file":"img/ee.jpg","dp_intro":"Electrical engineering is a technical discipline concerned with the study, design and application of equipment, devices and systems which use electricity, electronics, and electromagnetism.","sb_name":["微積分","物理","線性代數","微分方程","電路學"],"sb_img_file":["img/cal.jpg","img/phy.jpg","img/la.jpg","img/dif.jpg","img/cir.jpg"],"sb_intro":["Calculus is the mathematical study of continuous change, in the same way that geometry is the study of shape and algebra is the study of generalizations of arithmetic operations.","Physics is the natural science that studies matter, its motion, and behavior through space and time, and that studies the related entities of energy and force.","Linear algebra is central to almost all areas of mathematics. For instance, linear algebra is fundamental in modern presentations of geometry, including for defining basic objects such as lines, planes and rotations. ","A differential equation is a mathematical equation that relates some function with its derivatives. In applications, the functions usually represent physical quantities.","An electronic circuit is composed of individual electronic components, such as resistors, transistors, capacitors, inductors and diodes, connected by conductive wires or traces through which electric current can flow."]}
{"_id":{"$oid":"5cf4c4645963584af4c90a22"},"id":"2","dp_name":"輪機工程系","dp_abb":"ME","dp_img_file":"img/me.jpg","dp_intro":"Marine propulsion is the mechanism or system used to generate thrust to move a ship or boat across water.","sb_name":["微積分"],"sb_img_file":["img/cal.jpg"],"sb_intro":[""]}
{"_id":{"$oid":"5cf4c4a35963584af4c90a24"},"id":"3","dp_name":"通訊工程系","dp_abb":"CE","dp_img_file":"img/ce.jpg","dp_intro":"Telecommunications engineering is an engineering discipline centered on electrical and computer engineering which seeks to support and enhance telecommunication systems.","sb_name":["微積分"],"sb_img_file":["img/cal.jpg"],"sb_intro":[""]}
